# YOLOv9
 
# parameters
nc: 1 # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()
 
# anchors
anchors: 3
 
# YOLOv9 backbone
backbone:
  [
   [-1, 1, Silence, []],  
   
   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
 
   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4
 
   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 3
   [-1, 1, SOCA, [256]],  # 4
 
   # avg-conv down
   [-1, 1, ADown, [256]],  # 5-P3/8
 
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 6
   [-1, 1, SOCA, [512]],  # 7
 
   # avg-conv down
   [-1, 1, ADown, [512]],  # 8-P4/16
 
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 9
   [-1, 1, SOCA, [512]],  # 10
 
   # avg-conv down
   [-1, 1, ADown, [512]],  # 11-P5/32
 
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 12
   [-1, 1, SOCA, [512]],  # 13
  ]
 
# YOLOv9 head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  # 14
 
   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 10], 1, Concat, [1]],  # cat backbone P4
 
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 17
 
   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P3
 
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 20 (P3/8-small)
 
   # avg-conv-down merge
   [-1, 1, ADown, [256]],
   [[-1, 17], 1, Concat, [1]],  # cat head P4
 
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 23 (P4/16-medium)
 
   # avg-conv-down merge
   [-1, 1, ADown, [512]],
   [[-1, 14], 1, Concat, [1]],  # cat head P5
 
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 26 (P5/32-large)
   
   
   # multi-level reversible auxiliary branch
   
   # routing
   [7, 1, CBLinear, [[256]]], # 27
   [10, 1, CBLinear, [[256, 512]]], # 28
   [13, 1, CBLinear, [[256, 512, 512]]], # 29
   
   # conv down
   [0, 1, Conv, [64, 3, 2]],  # 30-P1/2
 
   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 31-P2/4
 
   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 32
 
   # avg-conv down fuse
   [-1, 1, ADown, [256]],  # 33-P3/8
   [[27, 28, 29, -1], 1, CBFuse, [[0, 0, 0]]], # 34  
 
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 35
 
   # avg-conv down fuse
   [-1, 1, ADown, [512]],  # 36-P4/16
   [[28, 29, -1], 1, CBFuse, [[1, 1]]], # 37
 
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 38
 
   # avg-conv down fuse
   [-1, 1, ADown, [512]],  # 39-P5/32
   [[29, -1], 1, CBFuse, [[2]]], # 40
 
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 41
   
   
   
   # detection head
 
   # detect
   [[35, 38, 41, 20, 23, 26], 1, DualDDetect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]